app/controllers/users_controller.rb

INSERT INTO "users" ("name", "user_name", "password_digest", "star_sign", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
        @user = User.new(user_params)
        if @user.valid?
            @user.save

SELECT "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT ?  [["user_name", "kitty"], ["LIMIT", 1]]
---
    def login
        @user = User.find_by(user_name: params[:user][:user_name])